run/tutorials/JetFlameH2/unsteady-openfoam4/01-ED-1step/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          1e-7;

writeControl    adjustableRunTime;

writeInterval   1e-2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.1;


// ************************************************************************* //


functions
{
	outputFrequency 1000;

	probes
	{
		// Where to load it from
		functionObjectLibs ( "libsampling.so" );

		// Type
		type probes;

		// Name of the directory for probe data
		name probes;

		// Write at same frequency as fields
		writeControl timeStep;
		writeInterval $outputFrequency;

		// Fields to be probed
		fields
		( 
			T H2 O2 H2O
		);

		// Locations to be probed. runTime modifiable!
		probeLocations
		( 
			(1e-8 0 200e-3) 
			(1e-8 0 300e-3)
			(1e-8 0 400e-3)
		);

	}

	fieldMinMax
    	{
        	type fieldMinMax;
        	functionObjectLibs ("libfieldFunctionObjects.so");
        	log no;
        
		writeControl  timeStep;
        	writeInterval $outputFrequency;
        	mode magnitude;
        	fields
        	(
            		T H2 O2 H2O
        	);
    	}

	profiles
  	{
   		type sets;
    		enabled true;
    		verbose false;
    		interpolationScheme cellPoint;

    		writeControl timeStep;
		writeInterval 2500;

    		setFormat raw;
    		fields 
		( 
			T H2 O2 H2O
		);

    		sets
    		(
      			profile-axis
      			{
        			type face;
        			axis z;
        			start ( 1e-8 0  0 	);
        			end   ( 1e-8 0  500e-3  );
        			nPoints 100;
      			}
    		);
  	}
}
